Documents/СписаниеНеиспользованнойСубсидии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>СписаниеНеиспользованнойСубсидии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыПоСубсидиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоСубсидиям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГраницаСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СписаниеНеиспользованнойСубсидии/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗакрытиеЛицевогоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоСубсидиямОстатки.Организация,
		|	РасчетыПоСубсидиямОстатки.ЛицевойСчет,
		|	РасчетыПоСубсидиямОстатки.Услуга,
		|	РасчетыПоСубсидиямОстатки.МесяцНачисления КАК МесяцНачисления,
		|	СУММА(РасчетыПоСубсидиямОстатки.СуммаОстаток) КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыПоСубсидиям.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет.Владелец = &Здание) КАК РасчетыПоСубсидиямОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыПоСубсидиямОстатки.ЛицевойСчет,
		|	РасчетыПоСубсидиямОстатки.МесяцНачисления,
		|	РасчетыПоСубсидиямОстатки.Услуга,
		|	РасчетыПоСубсидиямОстатки.Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	МесяцНачисления";
		
		
	Запрос.УстановитьПараметр("Период", Новый Граница(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", ДокументСсылкаЗакрытиеЛицевогоСчета.Организация);
	Запрос.УстановитьПараметр("Здание", ДокументСсылкаЗакрытиеЛицевогоСчета.Здание);
	Запрос.УстановитьПараметр("Дата", ДокументСсылкаЗакрытиеЛицевогоСчета.Дата);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ТаблицаСубсидии =  РезультатЗапроса.Выгрузить();
	
		
	
	ТаблицаРасчетыПоСубсидиям = Новый ТаблицаЗначений;
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("ВидДвижения");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Период");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Организация");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("ЛицевойСчет");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Услуга");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("МесяцНачисления");
	ТаблицаРасчетыПоСубсидиям.Колонки.Добавить("Сумма");
	
	Для каждого Строка Из ТаблицаСубсидии Цикл
	
		 НоваяСтрока = ТаблицаРасчетыПоСубсидиям.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		 НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		 НоваяСтрока.Период = ДокументСсылкаЗакрытиеЛицевогоСчета.Дата;
	
	
	КонецЦикла; 
	
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГарантированныеСубсидии", ТаблицаРасчетыПоСубсидиям);


КонецПроцедуры
